ITEM_INIT = {
    ["刀"] = {
        name = {
            "金背大砍刀", "门扇大刀", "齐凤朝阳刀", "象鼻古月刀", "青龙偃月刀", "银龙锁日月三挺砍山刀", "三尖两刃刀", "合扇板门刀",
            "金背砍山刀", "三尖两刃四窍八环刀", "雁翎刀", "青铜刀", "丹凤刀", "板门红缨刀", "锈绒刀", "三挺金背刀", "狼牙刀", "七星刀",
            "金背刀", "三挺刀", "七星摺花刀", "虎牙刀", "九耳八环刀", "子母龙凤双刀", "鱼鳞紫金刀", "三叉鬼头刀", "厚背尖翅雁翎刀",
            "五金折铁刀", "压把丘龙刀", "锯齿飞镰大砍刀", "电光刀", "绣鸾刀", "金背七星刀", "锯齿狼牙刀", "压把金背刀", "九耳八环青铜刀",
            "九凤朝阳刀", "象卷鼻子大刀", "八宝驼龙刀", "柳叶披风刀", "三挺门扇刀", "锯齿飞镰三挺大砍刀", "龙凤日月刀", "衮龙劈水电光刀",
            "锯齿飞镰合扇板门刀", "七宝措金刀", "赤铜刀", "金丝大环刀", "龟灵七宝刀", "劈水刀", "龙鳞紫金刀", "柳叶金错刀", "青钢刀",
            "鱼鳞贴金刀", "虎头刀", "金背铜环刀", "象鼻子卷帘刀", "九环大砍刀", "三环宝刀", "金凤刀", "三挺门扇大砍刀", "九连环大砍刀",
            "龙凤宝刀", "诛龙刀", "银合刀", "八卦电光刀", "锯齿刀", "金攥双凤刀", "金背鬼头刀", "八卦劈水刀", "八卦透龙刀", "八卦透龙劈水刀",
            "虎头墨麟刀", "七宝刀", "板门刀", "锯齿飞镰刀", "古月象鼻刀", "柳叶双刀", "亮银刀", "金臂砍山刀", "九耳八环大砍刀", "勾搂象鼻刀",
            "镔铁门扇刀", "劈水鬼头刀", "三叉鬼头刀", "银面大刀", "银面鬼头刀", "镔铁宝刀", "锯齿大砍刀", "豹皮雁翎刀", "金背滚珠刀",
            "青铜板门刀", "紫铜刀", "五凤朝阳刀", "三亭板门刀", "三亭锯齿飞镰刀", "九凤朝阳珍珠刀", "青龙偃月三亭刀", "象鼻古月钩搂刀",
            "八宝转环刀", "七星古月刀", "秋水雁翎刀", "卧龙宝刀", "九耳八环两刃刀", "风翅刀", "三亭大砍刀", "三缨鬼头刀", "九环金攥定唐刀",
            "三尖两刃青锋刀", "九耳八环太阴刀", "锯齿狼牙双手带", "珍珠龙凤刀", "亮银扑风刀", "卷帘象鼻古月刀", "青锋合扇板门刀", "九耳八环青铜偃月刀",
            "金背开岭砍山刀", "锯齿狼牙合扇板门刀", "鹅头刀", "八宝雁翎刀", "九凤朝阳乌金宝刀", "八卦乾坤锋", "翘尖压把鬼头刀", "蛾眉柳叶刀", "泼风大砍刀",
            "龙头扎刀", "五虎断门刀", "锯齿钩镰刀", "鸿毛宝刀", "金丝龙鳞闪电劈", "泼风大环刀", "泼风九环刀", "乾坤日月刀", "麟角刀", "三亭冷偃铄合扇板门刀",
            "冷月寒霜宝刀", "紫金八卦刀", "鲶鱼刀", "大夏龙鳞宝刀", "冰魄寒光刀", "天皇苍龙宝刀", "鱼鳞金背刀", "龟麟七宝刀", "压把翘尖柳叶刀", "八卦泼风刀",
            "七宝镶嵌刀", "龙鳞宝刀", "柳叶绵丝刀", "藤杆钩镰刀", "大夏龙雀刀", "降龙宝刀", "鬼头大环刀", "锯齿飞镰板门刀", "七星镔铁刀", "乌金折铁刀",
            "盘龙金背大砍刀", "截头金背大刀", "龙凤宝刀", "金翅大环宝刀", "虎头宝刀", "螭虎缺尖卧龙宝刀", "碧玉七星刀", "金背劈水电光刀", "金背折铁刀",
            "八宝电光刀", "龙形刀", "螭虎销金缺尖卧龙刀"
        },
        attr = {
            "attack", --攻击力
            "aim", -- 命中
            "hemophagia", -- 吸血
            "damage_extent", -- 增伤
            "knocking_odds", -- 暴击几率
            "knocking_extent", -- 暴击增伤
            "e_physical", --物理强化
            "e_magic", --魔法强化
            "e_fire",
            "e_ice",
            "e_electric",
            "e_poison",
        },
        ico = {},
    },
    ["枪"] = {
        name = {
            "如意金枪", "镔铁点钢枪", "梅花亮银枪", "盘竹枪", "虎头錾金枪", "素缨枪", "五钩神飞枪", "吸水提卢枪", "兽角点金枪", "镔铁皂缨枪", "钩镰枪", "蛇镰枪", "虎牙枪",
            "丈八蛇矛", "乌金枪", "浑铁枪", "虎头钻金枪", "麒麟双枪", "鹿筋软藤枪", "点钢枪", "十三节链子枪", "五钩神飞亮银枪", "虎头凿金枪", "丈八蛇矛枪", "素白亮银枪",
            "六合枪", "金攥提卢枪", "蟠龙金枪", "金锋枪", "三尖四刃锋", "鹿筋藤蛇枪", "梨花枪", "丈八滚云枪", "提卢枪", "金攥坜泉枪", "凤嘴梨花枪", "火尖枪",
            "龟背驼龙枪", "钢骨亮银枪", "杵白梨花枪", "五钩枪", "浑铁点钢枪", "鸡嘴枪", "鸭嘴枪", "金凤枪", "银杆枪", "青铜驼牛枪", "白杆小银枪", "镔铁皂缨枪", "鸭嘴亮银枪",
            "乌龙枪", "十三节钩镰枪", "双头五节笔管枪", "捶金虎头枪", "六轮点钢枪", "丈八毒蛇矛", "盘龙飞凤", "亮银八宝黑缨枪", "力贯枪", "盘蛇枪", "皂金虎头枪",
            "金冠宝枪", "莲花枪", "丈八大枪", "梅花枪", "单戟月牙枪", "雀舌枪", "丈八矛枪", "五钩神飞梅花亮银枪", "乌金虎头枪", "八宝驼龙阴风枪", "水火夺魂枪",
            "丈八素银枪", "五钩亮银枪", "金攥盘龙枪", "紫金盘龙枪", "豹尾枪", "杵白亮银枪", "丈二点金枪", "亮银点刚枪", "双尖锁链枪", "血挡梅花枪", "鸭嘴蘸金枪",
            "丈八蛇矛点刚枪", "金攥虎头枪", "盘龙亮银枪", "八宝金丝软藤枪", "丈八五钩神飞枪", "九转盘龙亮银枪", "链子双枪", "八宝龟背驼龙枪", "素缨亮银枪",
            "金攥红缨火焰枪", "金攥提卢吸水枪", "五毒透龙枪", "苗子枪", "丈八独龙枪", "丈八亮银枪", "烈焰蛇矛", "丈八蛇矛镔铁枪", "粉龙枪",
            "虎头亮银枪", "赤丝软藤枪", "胆膛枪", "丧门大枪", "五背驼牛大铁枪", "三棱五钩神飞枪",  "丈八梅花亮银枪", "自斩玄卢枪", "银蟒枪",
            "九曲点刚蛇矛枪", "独牛战杆", "金攥虎头枪", "燕尾神枪", "盘龙一字点刚枪", "阴风虎头矛", "驼龙阴风枪", "蛇形剑", "金蛇宝剑", "鸭嘴点刚枪", "竹节双枪",
            "火龙枪", "佛母紫金枪", "丈八黑缨枪", "双尖枪", "五节连环枪", "八宝驼龙枪", "提炉双枪", "龙头皂金枪", "镔铁笔管枪", "亮银八宝五钩神飞枪",
            "亮银子母鸳鸯五分枪", "八宝驼龙金丝软藤枪", "藤子双蛇枪", "十三节点穴枪", "双钩银丝鹿筋枪"
        },
        attr = {
            "attack_speed", -- 攻速
            "attack", --攻击力
            "avoid", -- 回避
            "aim", -- 命中
            "hemophagia", -- 吸血
            "damage_extent", -- 增伤
            "knocking_odds", -- 暴击几率
            "knocking_extent", -- 暴击增伤
            "e_physical", --物理强化
            "e_magic", --魔法强化
            "e_fire",
            "e_ice",
            "e_electric",
            "e_poison",
        },
        ico = {}
    },
    ["锤"] = {
        name = {
            "八楞紫金锤", "八楞黄金锤", "八卦生铜锤", "八楞亮银锤", "镔铁轧油锤", "八卦亮银锤", "擂鼓瓮金锤", "龙头链子锤", "八楞生铁锤", "八卦生铜链子锤", "八卦镔铁锤",
            "黑虎铜锤", "乌金锤", "压把懒龙锤", "人面赤铜锤", "瓜梭锤", "八宝电光锤", "青铜链子锤", "电光紫金锤", "八棱铜锤", "金瓜锤", "剌耳锤", "浑圆锤", "青铜窝瓜锤",
            "梅花八卦亮银锤", "子母鸳鸯锤", "亮银链子锤", "链子毒蒺藜锤", "八棱镔铁锤", "八角紫金锤", "红铜锤", "五毒瘟璜人面锤", "银面铜锤", "链子紫金瓜", "五毒链子锤",
            "八梭锤", "八棱闪电锤", "鎏金锤", "八宝电光锤", "丈八链子乌金锤", "八棱青铜锤", "链子铜锤", "花托熟铜窝瓜锤", "牛头锤", "西瓜亮银锤", "八棱梅花亮银锤",
            "长把紫金瓜", "八棱梅花链子乌金锤", "虎头锤", "人面鎏金锤", "八宝亮银", "梅花锤", "八棱紫金链子锤", "压把鎏金锤", "金攥轧油锤", "短链铜锤", "金顶轧油锤",
            "佛手紫金瓜", "青钢锤", "八棱亮金锤", "八棱青铜锤", "八棱紫金窝瓜锤", "骷骨点金锤", "八宝亮银锤"
        },
        attr = {
            "attack", --攻击力
            "hemophagia", -- 吸血
            "damage_extent", -- 增伤
            "knocking_odds", -- 暴击几率
            "knocking_extent", -- 暴击增伤
            "e_physical", --物理强化
            "e_magic", --魔法强化
            "e_fire",
            "e_ice",
            "e_electric",
            "e_poison",
        },
        ico = {}
    },
    ["剑"] = {
        name = {
            "松纹古定剑", "七星鎏虹剑", "烈焰青锋剑", "透龙剑", "太阿剑", "丧门宝剑", "紫电青霜剑", "鱼肠剑", "二刃青锋剑", "紫霜剑", "碧灵剑", "盘蛇宝剑", "盘龙宝剑",
            "天狼剑", "七星宝剑", "乌钩剑", "青钢剑", "鸳鸯剑", "碧血鸳鸯剑", "青萍剑", "昆吾剑", "太合剑", "纯钩剑", "雌雄双股剑", "日月火龙剑", "青龙剑", "诛龙剑", "困龙剑", "寒光剑",
            "折铁搂银五凤剑", "七星昆吾剑", "柳叶剑", "分天剑", "落叶青锋剑","二刃青钢剑", "长虹剑", "斩仙剑", "双刃软钢劈水电光剑", "太和剑", "乌龙剑", "青云剑",
            "北斗七星宝剑", "罗平剑", "巨阙剑", "梨花宝剑", "白光剑","清风落叶扫", "乾坤宇宙锋", "碧月秋光剑", "碧月秋光扫落叶", "碧月秋光扫魔剑", "碧血鸳鸯剑", "白鹤剑",
            "古铜宝剑", "青鸿剑", "乾坤剑", "碧光剑", "七星丧门剑", "纯钢剑", "青光剑", "八卦剑", "二刃青霜剑", "太极剑", "亮人双锋昆吾剑", "滚珠剑", "霜华宝剑", "断玉宝剑",
            "游龙宝剑", "龙纹剑", "丹凤剑", "龙吟剑", "三皇宝剑", "七星紫电扫风剑", "龙渊剑", "青明宝剑", "白云宝剑", "白虹宝剑", "日月乾坤剑", "佛光剑", "蓝玉剑", "赤霞剑",
            "腾蛟宝剑", "凤翎宝剑", "屠龙宝剑", "天虹宝剑", "干将宝剑", "白龙剑", "凝碧剑", "白虎剑", "银蛇宝剑", "阴风剑", "勾搂剑", "长歌宝剑", "五龙金剑", "素娄剑", "柔刚剑",
            "紫烟剑", "白雾剑", "秦王剑", "紫电凝霜剑", "龙凤宝剑", "霹雳剑", "独龙阴风剑", "苍龙五虎剑", "追魂剑", "天地人三皇剑", "阴阳双锋剑", "裁云宝剑"
        },
        attr = {
            "attack_speed", -- 攻速
            "attack", --攻击力
            "avoid", -- 回避
            "aim", -- 命中
            "hemophagia", -- 吸血
            "damage_extent", -- 增伤
            "knocking_odds", -- 暴击几率
            "knocking_extent", -- 暴击增伤
            "e_physical", --物理强化
            "e_magic", --魔法强化
            "e_fire",
            "e_ice",
            "e_electric",
            "e_poison",
        },
        ico = {}
    },
    ["甲"] = {
        name = {
            "守护之铠", "镜芒铠", "圣痕之铠", "奇迹庇佑", "龙麟铠甲","至尊血铸褶裙", "精灵之镶带长角", "露指之血斑甲", "白蚁之夜纹外衣", "龙葵步兵胸甲",
            "龙骨火壳胸甲", "彩色薄纱之牙", "达拉之哥特铠甲", "修道士巫师袍", "精神之血纹壳甲", "顽童之咒术外衣", "珠串活力布袍", "冲锋者之精灵护胸", "怒爪之奥秘腿铠",
            "浸毒之丰饶甲", "猎鹰腿铠", "骑兵之波力之衣", "毒蘑菇之火壳布袍", "之圣骑巫师袍", "精灵之天国护甲", "校军黑雾褶裙", "月冕之阳鳞壳甲", "旅者之石墨甲",
            "暗影抗性之斥候长袍", "督军之骑士护裙", "巨猿之珊瑚衬裙", "寒冰抗性之符记护甲", "亚麻咒术铠甲", "火焰抗性雪花甲"
        },
        attr = {
            "life", -- 生命
            "mana", -- 魔法
            "move", -- 移速
            "defend", -- 防御
            "life_back", -- 生命回复
            "avoid", -- 回避
            "e_physical_oppose", --物理抵抗
            "e_magic_oppose", -- 魔法抵抗
            "e_fire_oppose",
            "e_ice_oppose",
            "e_electric_oppose",
            "e_poison_oppose",
            "swim_oppose", -- 晕眩抵抗
            "broken_oppose", -- 打断抵抗
            "silent_oppose", -- 沉默抵抗
            "unarm_oppose", -- 缴械抵抗
            "fetter_oppose", -- 定身抵抗
            "damage_decrease", --减伤
        },
        ico = {}
    }
}

for i = 1, 195 do
    table.insert(ITEM_INIT["刀"].ico,"war3mapTextures\\dao\\dao" .. i .. ".blp")
end

for i = 1, 140 do
    table.insert(ITEM_INIT["枪"].ico,"war3mapTextures\\qiang\\qiang" .. i .. ".blp")
end

for i = 1, 390 do
    table.insert(ITEM_INIT["锤"].ico,"war3mapTextures\\chui\\chui" .. i .. ".blp")
end

for i = 1, 467 do
    table.insert(ITEM_INIT["剑"].ico,"war3mapTextures\\jian\\jian" .. i .. ".blp")
end

for i = 1, 850 do
    table.insert(ITEM_INIT["甲"].ico,"war3mapTextures\\jia\\jia" .. i .. ".blp")
end